---
kind: type
id: T:Autodesk.Revit.UI.DockablePaneProviderData
source: html/25c4224d-bc54-f2ed-589d-881a6ccbda87.htm
---
# Autodesk.Revit.UI.DockablePaneProviderData

Information about a new dockable pane being added to the Revit user interface.

## Syntax (C#)
```csharp
public class DockablePaneProviderData
```